### pandas.DataFrame.head

**DataFrame.head(n=5)**

Return the first n rows.

This function returns the first n rows for the object based on position. It is useful for quickly testing if your object has the right type of data in it.

For negative values of n, this function returns all rows except the last |n| rows, equivalent to `df[:n]`. If n is larger than the number of rows, this function returns all rows.

#### Parameters:
- **n**: `int`, default 5  
  Number of rows to select.

#### Returns:
- **same type as caller**  
  The first n rows of the caller object.

In [2]:
import pandas as pd 
import numpy as np

# DataFrame uchun ma'lumotlar
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Fanny', 'Greta'],
    'Age': [24, 30, 22, 35, 29, 25, 40],
    'Salary': [70000, 80000, 65000, 90000, 75000,85000,50000],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR','IT','Finance'],
    'Joining_Date': pd.to_datetime(['2020-01-15', '2019-03-22', '2021-07-30', '2018-11-05', '2020-06-10','2018-11-05', '2020-06-10']),
    'Performance_Score': [3.5, 4.0, 3.8, 4.5, 4.2,4.3,4.4],
    'Is_Manager': [False, True, False, True, False,True,False]
}

# DataFrame ni yaratish
df = pd.DataFrame(data)

# DataFrame ni ko'rsatish
print(df)

      Name  Age  Salary Department Joining_Date  Performance_Score  Is_Manager
0    Alice   24   70000         HR   2020-01-15                3.5       False
1      Bob   30   80000         IT   2019-03-22                4.0        True
2  Charlie   22   65000    Finance   2021-07-30                3.8       False
3    David   35   90000         IT   2018-11-05                4.5        True
4      Eva   29   75000         HR   2020-06-10                4.2       False
5    Fanny   25   85000         IT   2018-11-05                4.3        True
6    Greta   40   50000    Finance   2020-06-10                4.4       False

In [3]:
df.head()

      Name  Age  Salary Department Joining_Date  Performance_Score  Is_Manager
0    Alice   24   70000         HR   2020-01-15                3.5       False
1      Bob   30   80000         IT   2019-03-22                4.0        True
2  Charlie   22   65000    Finance   2021-07-30                3.8       False
3    David   35   90000         IT   2018-11-05                4.5        True
4      Eva   29   75000         HR   2020-06-10                4.2       False

In [4]:
df.head(6)

      Name  Age  Salary Department Joining_Date  Performance_Score  Is_Manager
0    Alice   24   70000         HR   2020-01-15                3.5       False
1      Bob   30   80000         IT   2019-03-22                4.0        True
2  Charlie   22   65000    Finance   2021-07-30                3.8       False
3    David   35   90000         IT   2018-11-05                4.5        True
4      Eva   29   75000         HR   2020-06-10                4.2       False
5    Fanny   25   85000         IT   2018-11-05                4.3        True

### pandas.DataFrame.tail

**DataFrame.tail(n=5)**

Return the last n rows.

This function returns the last n rows from the object based on position. It is useful for quickly verifying data, for example, after sorting or appending rows.

For negative values of n, this function returns all rows except the first |n| rows, equivalent to `df[|n|:]`. If n is larger than the number of rows, this function returns all rows.

#### Parameters:
- **n**: `int`, default 5  
  Number of rows to select.

#### Returns:
- **type of caller**  
  The last n rows of the caller object.

In [5]:
df.tail()

      Name  Age  Salary Department Joining_Date  Performance_Score  Is_Manager
2  Charlie   22   65000    Finance   2021-07-30                3.8       False
3    David   35   90000         IT   2018-11-05                4.5        True
4      Eva   29   75000         HR   2020-06-10                4.2       False
5    Fanny   25   85000         IT   2018-11-05                4.3        True
6    Greta   40   50000    Finance   2020-06-10                4.4       False

In [6]:
df.tail(6)

      Name  Age  Salary Department Joining_Date  Performance_Score  Is_Manager
1      Bob   30   80000         IT   2019-03-22                4.0        True
2  Charlie   22   65000    Finance   2021-07-30                3.8       False
3    David   35   90000         IT   2018-11-05                4.5        True
4      Eva   29   75000         HR   2020-06-10                4.2       False
5    Fanny   25   85000         IT   2018-11-05                4.3        True
6    Greta   40   50000    Finance   2020-06-10                4.4       False

### df[["col1", "col2"]]: Select specific columns.

In [7]:
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
5      Fanny
6      Greta
Name: Name, dtype: object

In [8]:
df[['Name','Age','Joining_Date']]

      Name  Age Joining_Date
0    Alice   24   2020-01-15
1      Bob   30   2019-03-22
2  Charlie   22   2021-07-30
3    David   35   2018-11-05
4      Eva   29   2020-06-10
5    Fanny   25   2018-11-05
6    Greta   40   2020-06-10

### pandas.DataFrame.iloc

**property DataFrame.iloc**

Purely integer-location based indexing for selection by position.

*Deprecated since version 2.2.0:* Returning a tuple from a callable is deprecated.

`.iloc[]` is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

#### Allowed inputs are:
- An integer, e.g. `5`.
- A list or array of integers, e.g. `[4, 3, 0]`.
- A slice object with ints, e.g. `1:7`.
- A boolean array.
- A callable function with one argument (the calling Series or DataFrame) that returns valid output for indexing (one of the above). This is useful in method chains when you don’t have a reference to the calling object but would like to base your selection on some value.
- A tuple of row and column indexes. The tuple elements consist of one of the above inputs, e.g. `(0, 1)`.

`.iloc` will raise `IndexError` if a requested indexer is out-of-bounds, except slice indexers which allow out-of-bounds indexing (this conforms with Python/Numpy slice semantics).

In [17]:
df.iloc[[0,4,6]]

    Name  Age  Salary Department Joining_Date  Performance_Score  Is_Manager
0  Alice   24   70000         HR   2020-01-15                3.5       False
4    Eva   29   75000         HR   2020-06-10                4.2       False
6  Greta   40   50000    Finance   2020-06-10                4.4       False

In [21]:
df.iloc[[1,4,3],[1,3]]

   Age Department
1   30         IT
4   29         HR
3   35         IT

In [22]:
df.iloc[:3,3:]

  Department Joining_Date  Performance_Score  Is_Manager
0         HR   2020-01-15                3.5       False
1         IT   2019-03-22                4.0        True
2    Finance   2021-07-30                3.8       False

In [23]:
df.iloc[:, lambda df: [0, 2]]

      Name  Salary
0    Alice   70000
1      Bob   80000
2  Charlie   65000
3    David   90000
4      Eva   75000
5    Fanny   85000
6    Greta   50000

### pandas.DataFrame.loc

**property DataFrame.loc**

Access a group of rows and columns by label(s) or a boolean array.

`.loc[]` is primarily label based, but may also be used with a boolean array.

#### Allowed inputs are:
- A single label, e.g. `5` or `'a'`, (note that `5` is interpreted as a label of the index, and never as an integer position along the index).
- A list or array of labels, e.g. `['a', 'b', 'c']`.
- A slice object with labels, e.g. `'a':'f'`.  
  **Warning:** Note that contrary to usual Python slices, both the start and the stop are included.
- A boolean array of the same length as the axis being sliced, e.g. `[True, False, True]`.
- An alignable boolean Series. The index of the key will be aligned before masking.
- An alignable Index. The Index of the returned selection will be the input.
- A callable function with one argument (the calling Series or DataFrame) that returns valid output for indexing (one of the above).


#### Raises:
- **KeyError**  
  If any items are not found.
  
- **IndexingError**  
  If an indexed key is passed and its index is unalignable to the frame index.

In [26]:
df.iloc[1]

Name                                 Bob
Age                                   30
Salary                             80000
Department                            IT
Joining_Date         2019-03-22 00:00:00
Performance_Score                    4.0
Is_Manager                          True
Name: 1, dtype: object

In [30]:
df1=df.reindex(['a','b','c','d','e','f','j'])

In [35]:
df1.loc['a']

Name                               Alice
Age                                   24
Salary                             70000
Department                            HR
Joining_Date         2020-01-15 00:00:00
Performance_Score                    3.5
Is_Manager                         False
Name: a, dtype: object

In [36]:
df.loc[['a','b'],['Name','Age','Department']]

    Name  Age Department
a  Alice   24         HR
b    Bob   30         IT